class ECardType:
    LEADER = 1
    EMPLOYEE = 2
    STRATEGY = 3


class ECardRank:
    COMMON = 0
    GOOD = 1
    TRUMP = 2


class ELocation:
    # 先手
    P1 = 1
    # 后手
    P2 = 2
    ON_FIELD = 4
    HAND = 8
    GRAVE = 16
    EXILED = 32
    DECK = 64
    SIDE = 128
    UNKNOWN = 256
    ANY = 511


card_rank = ['普通', '优质', '王牌']
card_type = ['', '领袖', '雇员', '策略']
employee_type = {1: '常规', 2: '契约', 4: '继承', 8: '合约', 16: '秘密'}
strategy_type = {1: '常规', 2: '持续', 4: '单人', 8: '反制',
                 16: '契约', 32: '场地'}
location = {5: '场上', 9: '手牌', 17: '场下', 33: '移除', 65: '卡组',
            129: '备选卡组', 257: '未知', 6: '场上', 10: '手牌', 18: '场下', 34: '移除', 66: '卡组',
            130: '备选卡组', 258: '未知'}
choice = {0: '影响攻击力', 1: '影响防御力'}
effect_desc = {1: '调查筹码', 2: '生命力回复', 3: '造成伤害', 4: '伤害增减', 5: '生命力损失',
               10: '额外机会', 11: '重置次数',
               30: 'ATK上升', 31: '赋予效果', 32: '变为调查筹码', 33: '弱调查筹码',
               34: '影响力/附加值变动', 35: '摧毁卡', 36: '特殊入场', 37: '移除效果',
               38: '无效化', 39: 'ATK变化', 40: '保护协议', 41: '持续时间结束',
               42: '复原', 43: '封锁/禁止', 44: '常规入场', 45: '穿透', 46: '送去场下',
               47: '加入手牌', 48: '移除', 49: '加入卡组', 50: '加入副卡组', 51: '丢弃手牌',
               52: '改变姿态', 53: '属性变化'}

error_hints = {
    1: '用户名或密码错误。',
    2: '未找到指定的资源。',
    3: '新建卡组时，已有卡组达到99个。',
    4: '编辑随机卡组时，欲添加的卡不在允许范围内',
    5: '编辑随机卡组时，已编辑过2次。',
    6: '非法卡组。',
    7: '已在匹配队列或参与的对局未结束。',
    8: '未处于任何匹配队列或对局。',
    9: '错误输入',
}

game_err = {
    0: '无效输入。',
    1: '输入不在给定的范围内。',
    2: '取走的筹码不合规则(通常情况下，你只能取走单个筹码/两个相邻的筹码)。',
    3: '不能对空筹码进行操作。',
    4: '该位置上已存在筹码。',
    5: '无法进行这次雇员的入场。(不满足入场条件或被禁止)',
    6: '无法进行这次策略的发动。(不满足发动条件或被禁止)',
    7: '反制策略需要满足一定条件才能发动。',
    8: '使用超过次数限制。',
    9: '无法识别的卡。',
    10: '无法放置非秘密雇员。',
    11: '无法进行这次放置。',
    12: '无效输入orz',
    13: '无法进行这次攻击。',
    14: '不能在战斗阶段外攻击/不能在主要阶段外主动使用手牌或非触发的效果。',
    15: '已经处于明置状态。',
    16: '这次明置状态的改变被禁止。',
    17: 'FORBIDDEN_CP。',
    18: '防御姿态不能攻击。',
    19: '没有剩余攻击次数时不能转换姿态。',
}

game_phase = {
    0: '先后手决定阶段',
    1: '初始化阶段',
    2: '公示阶段',
    3: '额外生成阶段',
    4: '放置筹码阶段',
    5: '取走筹码阶段',
    6: '调整阶段',
    7: '使用筹码阶段'
}

turn_phase = {
    0: '回合开始阶段',
    1: '抽卡阶段',
    2: '主要阶段1',
    3: '战斗阶段1',
    4: '限制战斗阶段1',
    5: '限制战斗阶段2',
    6: '主要阶段2',
    7: '回合结束阶段',
}

time_point = {
    0: '起始阶段时',
    5: '先后手决定阶段开始时',
    10: '先后手决定阶段结束时',
    15: '公示阶段开始时',
    20: '公示阶段结束时',
    25: '额外生成阶段开始时',
    27: '附加值生成时',
    30: '附加值生成后',
    40: '调查筹码生成后',
    43: '额外生成阶段结束时',
    46: '放置筹码阶段开始时',
    50: '单个筹码被放置后',
    60: '所有筹码被放下后，附加值结算时',
    70: '附加值阶段后，放置筹码阶段末尾',
    75: '取走筹码阶段开始时',
    80: '对筹码的一次取走操作完成后',
    90: '取走筹码阶段结束时',
    100: '调整阶段开始时',
    110: '调整阶段结束时',
    115: '使用筹码阶段开始时',
    120: '尝试使雇员入场',
    121: '雇员入场时',
    122: '雇员入场成功',
    124: '尝试发动策略',
    125: '尝试发动效果',
    126: '尝试支付代价',
    127: '支付代价后',
    128: '效果处理成功后',
    129: '效果处理失败后',
    130: '尝试放置策略',
    131: '放置策略后',
    132: '尝试放置雇员',
    133: '放置雇员',
    134: '回合开始时',
    135: '抽卡阶段开始时',
    136: '主要阶段1开始时',
    137: '战斗阶段1开始时',
    138: '主要阶段2开始时',
    140: '回合结束时',
    139: '回合结束',
    142: '攻击宣言',
    141: '尝试发动攻击',
    143: '发生攻击时',
    144: '攻击伤害判定时',
    145: '攻击后',
    146: '被摧毁时',
    147: '被摧毁后',
    148: '离场时',
    149: '离场后',
    150: '离开手牌时',
    151: '离开手牌后',
    152: '离开主卡组时',
    153: '离开主卡组后',
    154: '离开副卡组时',
    155: '离开副卡组后',
    156: '离开场下时',
    157: '离开场下后',
    158: '离开移除区时',
    159: '离开移除区后',
    160: '入场时',
    161: '入场后',
    162: '加入手牌时',
    163: '加入手牌后',
    164: '加入主卡组时',
    165: '加入主卡组后',
    166: '加入副卡组时',
    167: '加入副卡组后',
    168: '进入场下时',
    169: '进入场下后',
    170: '加入移除区时',
    171: '加入移除区后',
    172: '尝试丢弃手牌',
    173: '丢弃手牌时',
    174: '被丢弃后',
    175: '尝试奉献',
    176: '奉献时',
    177: '奉献后',
    178: '尝试进行契约',
    179: '进行契约时',
    180: '进行契约后',
    181: '尝试抽卡',
    182: '抽卡时',
    183: '抽卡后',
    184: '使用筹码阶段将结束时',
    185: '尝试将效果无效',
    186: '效果将被无效时',
    187: '效果被无效后',
    188: '尝试阻挡',
    189: '阻挡时',
    190: '阻挡后',
    191: '展示卡时',
    192: '展示卡后',
    193: '攻击力/效力计算时',
    194: '攻击力/效力计算后',
    195: '防御力计算时',
    196: '防御力计算后',
    197: '限制战斗阶段1开始时',
    198: '限制战斗阶段2开始时',
    199: '发动策略时',
    200: '成功发动策略后',
    201: '尝试使雇员从手牌常规入场后',
    202: '尝试从手牌使用策略后',
    203: '重置攻击、阻挡次数时',
    204: '造成伤害时',
    205: '造成伤害后',
    206: '尝试支付生命力',
    207: '支付生命力时',
    208: '支付生命力后',
    209: '尝试选择目标',
    210: '选择目标时',
    211: '选择目标后',
    212: '尝试发动场上盖放的策略',
    213: '发动场上盖放的策略时',
    214: '发动场上盖放的策略后',
    215: '尝试主动明置场上盖放的雇员',
    216: '主动明置场上盖放的雇员时',
    217: '主动明置场上盖放的雇员后',
    218: '尝试改变雇员姿态',
    219: '改变雇员姿态时',
    220: '改变雇员姿态后',
    221: '询问主动效果时',
    222: '尝试回复生命力',
    223: '回复生命力时',
    224: '回复生命力后',
}
